#include <stdio.h>
#include <math.h>

// Функция, которую нужно проинтегрировать
double func(double x) {
    return 1/((25*x*x + 1)*sqrt(x));
}

// Вычисление узлов и весов для метода Лежандра
void computeNodesAndWeights(double *nodes, double *weights, int n) {
    int i, j;
    double p1, p2, p3, pp, z, z1;

    // Цикл для вычисления узлов и весов
    for (i = 1; i <= n; i++) {
        z = cos(M_PI * (i - 0.25) / (n + 0.5)); // Узел - корень полинома Лежандра
        z1 = z + 1.0; // Значение для начальной итерации метода Ньютона
        // Итерация метода Ньютона для нахождения узла
        while (fabs(z - z1) > 1e-10) {
            p1 = 1.0;
            p2 = 0.0;
            // Вычисление полинома Лежандра
            for (j = 0; j < n; j++) {
                p3 = p2;
                p2 = p1;
                p1 = ((2.0 * j + 1.0) * z * p2 - j * p3) / (j + 1);
            }
            // Вычисление производной полинома Лежандра
            pp = n * (z * p1 - p2) / (z * z - 1.0);
            z1 = z;
            z = z1 - p1 / pp; // Следующая итерация метода Ньютона
        }

        // Узел метода Лежандра
        nodes[i - 1] = z;
       // printf("%.8lf, ",nodes[i-1]);

        // Веса метода Лежандра
        weights[i - 1] = 2.0 / ((1.0 - z * z) * pp * pp);
       printf("%.8lf, ",weights[i-1]);

    }
    printf("\n");
}

// Метод Лежандра для вычисления интеграла
double integral_Gaus(int n, double a, double b) {
    double nodes[n], weights[n];
    double result = 0.0;
    //double nodes[16] = {0.989401, 0.944575, 0.865631, 0.755404, 0.617876, 0.458017, 0.281604,
   // 0.095013, -0.095013, -0.281604, -0.458017, -0.617876, -0.755404, -0.865631, -0.944575, -0.989401}; // Узлы 
   // double  weights[16] = {0.027152, 0.062254, 0.095159, 0.062254, 0.149596, 0.169157, 0.182603,
  //  0.189451, 0.189451, 0.182603, 0.169157, 0.149596, 0.124629, 0.095159, 0.062254, 0.027152}; // Веса 
    // Вычисление узлов и весов метода Лежандра
    computeNodesAndWeights(nodes, weights, n);

    // Вычисление интеграла методом Лежандра
    for (int i = 0; i < n; i++) {
        // Преобразование интервала [-1, 1] к интервалу [a, b]
        double x = ((b - a) * nodes[i] + (a + b)) / 2.0;
        result += weights[i] * func(x);
    }

    // Масштабирование результата к размеру интервала [a, b]
    result *= (b - a) / 2.0;

    return result;
}

int main() 
{
  //printf("16: integral  = %lf\n",integral_Gaus(16,1,2));
 // printf("32: integral  = %lf\n",integral_Gaus(32,1,2));
  printf("64: integral  = %lf\n",integral_Gaus(64,1,2));
  printf("difference((I-In)): %f\n", 1000000*(0.016832889701405 /*1.49364826562485405079*/ - integral_Gaus(16,1,2)));
//  printf("difference((I-In)): %f\n", 1000000*(0.016832889701405 /*1.49364826562485405079*/ - integral_Gaus(32,1,2)));
//  printf("difference((I-In)): %f\n", 1000000*(0.016832889701405 /*1.49364826562485405079*/ - integral_Gaus(64,1,2)));

}